# 5. Добавляем выводы и решения

## Таблица в консоли

### Цель

В этом задании мы закрепим знания, полученные в ходе вебинара, и сможем воспользоваться циклами и условными операторами

**Нужно написать программу, которое делает следующее:**

1. Есть функция (назовем ее `WriteTable(int n, string s)`)
2. Функция принимает на вход параметр n (целое число), и строку `s`. Если число меньше 1 или больше 6 - выводим текст введите число от 1 до 6 и выходим из функции. Если текст пустой - выводим сообщение текст не может быть пустым и выходим из функции.
3. Функция на основе значений n и строки s должна вывести три полоски на основе ASCII-арта
[пример работы программы](https://ctrl.vi/i/l4dirSXvD)

Требования к программе

4. Общая ширина не должна превышать 40 символов
5. Границы полосок - символ +
6. Ширина полосок (каждой) зависит от числа n и длины введенной строки из п.2.
7. Вывести 1ю строку с текстом s, введенным в п.2., который находится на расстоянии n-1 от каждой из границ строки.
8. Вывести 2ю строку. Она имеет ту же высоту, что и строка 1, и представляет собой набор символов +, чередующихся в шахматном порядке.
9. Вывести 3ю строку таблицы. Она должна быть квадратной, "перечеркнутая" символом + по диагоналям
В программе должны использоваться циклы `do while`, `while` и `for` и `?:` и `if`

Примечания
* Для получения длины строки используйте свойство `Length`, например `s.Length`
* Для Вывода строки с переносом на следующую строку воспользуйтесь функцией `Console.WriteLine`

_Пример_

```csharp
// Console.WriteLine("Privet");
// Console.WriteLine("Otus");

Privet
Otus
```
* Для Вывода строки без переноса на следующую строку воспользуйтесь функцией Console.Write

_Пример_

```csharp
// Console.Write("Privet");
// Console.Write("Otus");

PrivetOtus
```
